#+TITLE: Lispy

* Lisp code in org-mode
** Simpliest lisp code I can think of:

#+begin_src elisp :exports both
()
#+end_src

#+RESULTS:

**  Bit more complicated

#+begin_src emacs-lisp :exports both
(+ 1 2)
#+end_src

#+RESULTS:
: 3

*  Some scheme code evaluated

#+begin_src scheme :exports both
(car '("a" "b" "c"))
#+end_src

#+RESULTS:
: a


#+begin_src scheme :exports both
(and #t #f)
#+end_src

#+RESULTS:
: #f


*  The Little Schemer
** 0. Getting ready
#+name: common
#+begin_src scheme :session little-schemer
(define atom?
  (lambda (x)
    (and (not (pair? x)) (not (null? x)))))
#+end_src

#+RESULTS: common
: #<unspecified>


** 1. Toys
*** Let's first see the primitive things working. Is "atom" really an atom?

#+begin_src scheme :noweb yes :session little-schemer :exports both
 (atom? "atom")
#+end_src

#+RESULTS:
: #t

*** And is '("atom") really not an atom?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(atom? '("atom"))
#+end_src

#+RESULTS:
: #f

*** I wonder if '(atom) is a list?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(list? '(atom))
#+end_src

#+RESULTS:
: #t

*** I wonder if "(()()())" is a list?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(list? '(()()()))
#+end_src

#+RESULTS:
: #t

*** I wonder if "(atom is) out there" is a list?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(list? '(atom is) out there)
#+end_src

#+RESULTS:
...no answer...

*** What is *car* of (a b c)?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(car '(a b c))
#+end_src

#+RESULTS:
: a

*** What is *car* of ()?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(car '())
#+end_src

#+RESULTS:
...no answer...

*** What is *car* of an atom?
#+begin_src scheme :noweb yes :session little-schemer :exports both
(car 'atom)
#+end_src

#+RESULTS:
...no answer...

THE LAW OF CAR: the primitive *car* is defined only for non-empty lists.

*** What is *car* of an '(((hotdogs)) (and) (pickle) relish)?
#+begin_src scheme :noweb yes :session little-schemer :exports both
(car '(((hotdogs)) (and) (pickle) relish))
#+end_src

#+RESULTS:
| hotdogs |


*** What is *cdr* of ()?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(cdr '())
#+end_src

#+RESULTS:
...no answer...

*** What is *cdr* of the atom?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(cdr 'atom)
#+end_src

#+RESULTS:
...no answer...

THE LAW OF CDR: the primitive *cdr* is defined only for non-empty lists and always returns another list.

*** What is *(car (cdr '((b) (x y) ((c)))*?

#+begin_src scheme :noweb yes :session little-schemer :exports both
(car (cdr '((b) (x y) ((c)))))
#+end_src

#+RESULTS:
| x | y |
